"""
[별 찍기 - python방법1]
6-1
*****
****
***
**
*
"""
for i in range(5,0,-1):
    print("{}".format('*'*i))

"""
6-2
*
**
***
****
*****
"""



"""
6-3
    *
   **
  ***
 ****
*****
"""



"""
6-4
*****
 ****
  ***
   **
    *
"""



"""
6-5
    *
   ***
  *****
 *******
*********
"""



"""
6-6
*********
 *******
  *****
   ***
    *
"""



"""
6-7
    *
   ***
  *****
 *******
*********
 *******
  *****
   ***
    *
"""


"""
번외] 근의공식
def quad_equ(a, b, c):
    if a != 0:
        rootNum = b**2-4*a*c
        if rootNum >= 0:
            result1 = ((-b + rootNum**(1/2))/(2*a))
            result2 = ((-b - rootNum**(1/2))/(2*a))
            return result1,result2
        else:
            return "근이 없다."
    else:
        return "2차 방정식이 아니다."
print(quad_equ(1, 2, 1))
"""